# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-03-14 18:11:01 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* RPG [0/2]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  A disappointing attempt at a text-based role-playing game.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2025-03-14 Fr 18:10]
   | Headline                        | Time   |        |      |      |
   |---------------------------------+--------+--------+------+------|
   | *Total time*                    | *8:45* |        |      |      |
   |---------------------------------+--------+--------+------+------|
   | *RPG [0/2]*                     | *8:45* |        |      |      |
   | \_  /Components [0/0]/          |        | /8:45/ |      |      |
   | \_    Engine [0/1]              |        |        | 5:35 |      |
   | \_      Mechanics               |        |        |      | 3:50 |
   | \_    UI [0/1]                  |        |        | 3:10 |      |
   | \_      Create character, world |        |        |      | 2:36 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Engine [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-14 Fr 16:35]--[2025-03-14 Fr 18:10] =>  1:35
    CLOCK: [2025-03-13 Do 18:21]--[2025-03-13 Do 18:31] =>  0:10
    :END:
**** Storage
     I am going to need to store both the world(s) and the state of a running
     game.
     As I am feeling lazy, I think I'll use something like JSON or pickle. If
     I find that to be inconvenient, I will reconsider.
**** TODO Mechanics
     :LOGBOOK:
     CLOCK: [2025-03-14 Fr 13:05]--[2025-03-14 Fr 13:43] =>  0:38
     CLOCK: [2025-03-14 Fr 12:25]--[2025-03-14 Fr 13:00] =>  0:35
     CLOCK: [2025-03-13 Do 19:53]--[2025-03-13 Do 21:28] =>  1:35
     CLOCK: [2025-03-13 Do 18:42]--[2025-03-13 Do 19:33] =>  0:51
     CLOCK: [2025-03-13 Do 18:31]--[2025-03-13 Do 18:42] =>  0:11
     :END:
     This is going to be tricky. At least for me, because I have never done
     anything like this before. So there will be a lot of trial and error
     initially.
*** UI [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-03-14 Fr 14:50]--[2025-03-14 Fr 15:24] =>  0:34
    :END:
**** TODO Create character, world
     :LOGBOOK:
     CLOCK: [2025-03-13 Do 21:51]--[2025-03-14 Fr 00:25] =>  2:34
     CLOCK: [2025-03-13 Do 21:28]--[2025-03-13 Do 21:30] =>  0:02
     :END:
     In order to do some testing, I will need to create a player character and
     a world.
     Creating the world should be automatic, creating the player interactive.
** World building [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Plot [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
